#+TITLE: Session 7: Iterative Improvement — Stable Matching

** Part 5: Read Preferences from File

#+BEGIN_SRC python :results output
def load_from_file(filename):
    m_prefs, w_prefs = {}, {}
    target = m_prefs
    with open(filename, 'r') as f:
        for line in f:
            parts = line.split()
            if not parts:
                target = w_prefs
                continue
            target[parts[0]] = parts[1:]
    return m_prefs, w_prefs

# --- Write sample file and run ---
sample = """a u r t s
b r t u s
c t u s r
d u r t s

r a c d b
s d a b c
t c b d a
u b d c a
"""
with open('prefs.txt', 'w') as f:
    f.write(sample)

m_p, w_p = load_from_file('prefs.txt')
print("Loaded men:", m_p)
print("Loaded women:", w_p)
print()
gale_shapley(m_p, w_p)
#+END_SRC

#+RESULTS:
: Loaded men: {'a': ['u', 'r', 't', 's'], 'b': ['r', 't', 'u', 's'], 'c': ['t', 'u', 's', 'r'], 'd': ['u', 'r', 't', 's']}
: Loaded women: {'r': ['a', 'c', 'd', 'b'], 's': ['d', 'a', 'b', 'c'], 't': ['c', 'b', 'd', 'a'], 'u': ['b', 'd', 'c', 'a']}
: 
